//Дано натуральное число. Выведите его последнюю цифру. 
public class task6 {
    public static void main(String[] args) {
        int a = 123;
        System.out.println(a%10);
    }
}