//Создайте переменную, присвойте ей целочисленное значение. Выведите значение на экран
public class task2 {
    
    public static void main(String[] args) {
        int a = 20;
        System.out.println(a);
    }
}